//本程序由LNF_297提供 
#include<cstdio>
#include<iostream>
using namespace std;
int main()
{
	long long n,s=0;
	cin>>n;
	//-------------------------
	while(n)
	{
		s=s+n%10;
		n=n/10;
	}
	/*
	假设n的值为1234
	|--------------------------
	|循环体执行的次数| s             |n                  |
	|       1        | s=s+n%10=0+4 |n=n/10=1234/10=123 |
	|       2        | s=s+n%10=0+3 |n=n/10=123/10=12 |
	|       3        | s=s+n%10=0+2 |n=n/10=12/10=1 |
	|       4        | s=s+n%10=0+1 |n=n/10=1/10=0 |
	|此时n的值为零，跳出循环。
	由此可知，本循环体每次用s加上n的各位，然后将n/10，总之你懂得 
	如果还不懂，就不要在意细节了 
	*/
	//-------------------------
	cout<<s;
	return 0;
}
/*


          \ /
        -->*<--
          /o\
         /_\_\
        /_/_0_\
       /_o_\_\_\
      /_/_/_/_/o\
     /@\_\_\@\_\_\
    /_/_/O/_/_/_/_\
   /_\_\_\_\_\o\_\_\
  /_/0/_/_/_0_/_/@/_\
 /_\_\_\_\_\_\_\_\_\_\
/_/o/_/_/@/_/_/o/_/0/_\
         [___]  
*/ 
